Tekla Open API Reference for Tekla Structures 2025
RebarSpacingZone.SpacingEnum Enumeration
 The spacing type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SpacingEnum
Public Enumeration SpacingEnum
Members
Member name | Value | Description
EXACT | 0 |  The spacing is exact.
TARGET | 1 |  The spacing is a target value.
See Also
Reference
Tekla.Structures.Model Namespace